#include <stdio.h>
int main() {
    int numTime[9] = {0}; //นับจำนวนครั้งที่เดินเริ่มต้นที่ 0
    int i;  //นับรอบว่าเดินทิศนึงกี่รอบ
    int way; //ทิศที่หุ่นยนต์เดิน

    printf("-----เส้นทางของหุ่นยนต์ 8 เส้นทาง-----\n");
    printf("กำหนดทิศ 1=เหนือ, 2=ตะวันตกเฉียงเหนือ, 3=ตะวันตก, 4=ตะวันตกเฉียงใต้, 5=ใต้, 6=ตะวันออกเฉียงใต้, 7=ตะวันออก, 8=ตะวันออกเฉียงเหนือ \n");
    printf("-----หุ่นยนต์เคลื่อนที่ 8 ครั้ง-----\n");

    for(i = 1; i <= 8; i++) {
        printf("ครั้งที่: %d -> เคลื่อนที่ทางทิศ: ", i);
        scanf("%d", &way);  // ให้กรอกทิศเอง
        if(way >= 1 && way <= 8)
            numTime[way]++;
        else
            printf("กรอกทิศไม่ถูกต้อง (1-8 เท่านั้น)\n");
    }

    printf("========================\n");
    printf("-----สรุปผลการเคลื่อนที่-----\n");
    for(i = 1; i <= 8; i++)
        printf("ทิศ: %d -> %d ครั้ง\n", i, numTime[i]);

    return 0;
}

